---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewVertexIndexPairArray
source: html/e5b178a5-efa4-4b5c-375d-1215a56e3bb2.htm
---
# Autodesk.Revit.Creation.Application.NewVertexIndexPairArray Method

Returns an array that can hold VertexIndexPair objects.

## Syntax (C#)
```csharp
public VertexIndexPairArray NewVertexIndexPairArray()
```

## Returns
The new VertexIndexPairArray objects.